%% ------------Àı×Ó1---------------------------
x=[0  2  4  6  8  10  12 14 16 18 20];
y=[0.893 0.634 0.4148 0.3464 0.2847 0.2054 0.1466 0.1196 0.0994 0.0901 0.090];
y1=[0.814 0.541 0.3764 0.3095 0.2277 0.1508 0.1056 0.0892 0.0814 0.0742 0.0716];
%y2=[5  -8   -12   -18  -22  -28  -35 -40 -46 -65 -70];
values1=spcrv([[x(1) x x(end)];[y(1) y y(end)]],3,1000);
values2=spcrv([[x(1) x x(end)];[y1(1) y1 y1(end)]],3,1000);
%values3=spcrv([[x(1) x x(end)];[y1(1) y2 y2(end)]],3,1000);
%plot(values1(1,:),values1(2,:),'-k',values2(1,:),values2(2,:),'--k',values3(1,:),values3(2,:),'-.k')
plot(values1(1,:),values1(2,:),'-k',values2(1,:),values2(2,:),'--k')
%set(gca,'ytick',-100:20:10)
xlabel('epochs')  %xÖá×ø±êÃèÊö
ylabel('MSE') %yÖá×ø±êÃèÊö
ylim([0 1])
%legend('75-40-30','75-50-30', '75-60-30'); 
legend('75-40-30','75-50-30'); 
set(gca,'fontsize',13);